app/controllers/apts_controller.rb

SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    apartment = Apartment.find(params["id"])

SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "apartments".* FROM "apartments" WHERE "apartments"."user_id" = $1  [["user_id", 1]]
DELETE FROM "apartments" WHERE "apartments"."id" = $1  [["id", 19]]
---
  def destroy

    apartment = Apartment.find(params['id'])
    user = User.find(apartment.user_id)
    apartment.destroy

INSERT INTO "apartments" ("user_id", "address", "zip") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["address", ""], ["zip", ""]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create

     apartment = Apartment.create(address: params["address"]["destination"], zip: params["address"]["zip"], user_id: params["user_id"])
     user = User.find(params["user_id"])