app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: auth_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "krissa.santos31@gmail.com"], ["LIMIT", 1]]