app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "p@p.com"], ["password_digest", "$2a$10$u1f4dpkuboxKGDtuTXuts.CNBsKml3Hq8Tl.nXyzQhaOYRB4ZraP2"], ["created_at", 2016-12-08 05:00:18 UTC], ["updated_at", 2016-12-08 05:00:18 UTC]]
---
 def create
   user = User.new(user_params)

   if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "commute" = $1, "safety" = $2, "category_2" = $3, "category_3" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["commute", 10], ["safety", 10], ["category_2", "dry clean"], ["category_3", "grocery"], ["updated_at", 2016-12-08 19:45:39 UTC], ["id", 10]]
---
 def update

   userId = Auth.decode(params["token"])["user_id"]
   user = User.find(userId)
   user.update(pref_params)